CREATE TABLE if not exists test_table(
      name VARCHAR(10) CHECK (CHAR_LENGTH(name) BETWEEN 4 AND 10),
      surname VARCHAR(20),
      city VARCHAR(20),
      age INT CHECK (age > 0 AND age <= 150));
      
INSERT INTO test_table VALUES
      ('Алина', 'Иванова', 'Москва', 28),
      ('Евгений', 'Петров', 'Волгоград', 65),
      ('Александр', 'Семенов', 'Санкт-Петербург', 42),
      ('Ангелина', 'Васильева', 'Череповец', 76),
      ('Петр', 'Иванов', 'Красноярск', 59),
      ('Василий', 'Теркин', 'Москва', 48),
      ('Семен', 'Рязанов', 'Рязань', 22),
      ('Алексей', 'Симонов', 'Кострома', 110),
      ('Андрей', 'Георгиев', 'Пенза', 35),
      ('Григорий', 'Крикунов', 'Смоленск', 18),
      ('Максим', 'Гришин', 'Воронеж', 56),
      ('Виктор', 'Потапов', 'Киров', 94),
      ('Аделина', 'Немцова', 'Омск', 71),
      ('Василиса', 'Никонова', 'Ярославль', 80),
      ('Анна', 'Краснова', 'Краснодар', 29),
      ('Элла', 'Гридина', 'Калининград', 38),
      ('Николай', 'Смирнов', 'Севастополь', 66),
      ('Сава', 'Стехин', 'Воронеж', 72),
      ('Всеволод', 'Попов', 'Смоленск', 116),
      ('Дмитрий', 'Вершинин', 'Норильск', 121),
      ('Сима', 'Перепелкина', 'Архангельск', 10);
